Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<BasedOn>
				<xr:Item>Document.ПоставляемаяНоменклатура</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаценкаР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Установка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияСтаройЦены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦенаРозничная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦенаРозничная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНаНоменклатуру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаНоменклатуру</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентИзмененияЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦен/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//Сообщить("Начало процедуры ОбработкаПроведения. Режим: " + Режим);
    
        Если Установка.Количество() = 0 Тогда
            Сообщить("Ошибка: Табличная часть 'Установка' пуста!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
        
        ДатаПериода = ЭтотОбъект.Дата; 
        
        Для Каждого СтрокаУстановки Из Установка Цикл
            Попытка
				//Сообщить("Обработка строки: " + СтрокаУстановки.НоменклатураД);
                
                Если ТипЗнч(СтрокаУстановки.НоменклатураД) <> Тип("СправочникСсылка.НоменклатураСПР") Тогда
                    Сообщить("Ошибка: Некорректный тип данных для номенклатуры!");
                    Отказ = Истина;
                    Продолжить;
                КонецЕсли;
				
				Если СтрокаУстановки.НоваяЦенаЗакупочная = Неопределено ИЛИ СтрокаУстановки.НоваяЦенаРозничная = Неопределено Тогда
                    Сообщить("Ошибка: Не заполнены цены для " + СтрокаУстановки.НоменклатураД);
                    Отказ = Истина;
                    Продолжить;
                КонецЕсли;
                
                Запрос = Новый Запрос;
                Запрос.Текст = 
                    "ВЫБРАТЬ
                    |    ЦеныНаНоменклатуру.Номенклатура,
                    |    ЦеныНаНоменклатуру.Период,
                    |    ЦеныНаНоменклатуру.ЗакупочнаяЦена,
                    |    ЦеныНаНоменклатуру.РозничнаяЦена
                    |ИЗ
                    |    РегистрСведений.ЦеныНаНоменклатуру КАК ЦеныНаНоменклатуру
                    |ГДЕ
                    |    ЦеныНаНоменклатуру.Номенклатура = &Номенклатура";
                
                Запрос.УстановитьПараметр("Номенклатура", СтрокаУстановки.НоменклатураД);
                РезультатЗапроса = Запрос.Выполнить();
                
                Если РезультатЗапроса.Пустой() Тогда
					//Сообщить("Создание новой записи для: " + СтрокаУстановки.НоменклатураД);
                    НоваяЗапись = РегистрыСведений.ЦеныНаНоменклатуру.СоздатьМенеджерЗаписи();
                    НоваяЗапись.Номенклатура = СтрокаУстановки.НоменклатураД;
                    НоваяЗапись.Период = ДатаПериода;
                Иначе
					//Сообщить("Обновление существующей записи для: " + СтрокаУстановки.НоменклатураД);
                    Выборка = РезультатЗапроса.Выбрать();
                    Выборка.Следующий();
                    НоваяЗапись = РегистрыСведений.ЦеныНаНоменклатуру.СоздатьМенеджерЗаписи();
                    НоваяЗапись.Номенклатура = Выборка.Номенклатура;
                    НоваяЗапись.Период = Выборка.Период;
                КонецЕсли;
                
                НоваяЗапись.ЗакупочнаяЦена = СтрокаУстановки.НоваяЦенаЗакупочная;
                НоваяЗапись.РозничнаяЦена = СтрокаУстановки.НоваяЦенаРозничная;
                
                НоваяЗапись.Записать();
				//Сообщить("Данные сохранены для: " + СтрокаУстановки.НоменклатураД);
                
            Исключение
                Сообщить("Ошибка для " + СтрокаУстановки.НоменклатураД + ": " + ОписаниеОшибки());
                Отказ = Истина;
            КонецПопытки;
        КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоставляемаяНоменклатура") Тогда
        Для Каждого ТекСтрокаПоставка Из ДанныеЗаполнения.Поставка Цикл
            
            ДатаПериода = ЭтотОбъект.Дата; 
            
            
            Запрос = Новый Запрос;
            Запрос.Текст = 
                "ВЫБРАТЬ
                |    ЦеныНаНоменклатуру.Номенклатура,
                |    ЦеныНаНоменклатуру.ЗакупочнаяЦена,
                |    ЦеныНаНоменклатуру.РозничнаяЦена
                |ИЗ
                |    РегистрСведений.ЦеныНаНоменклатуру КАК ЦеныНаНоменклатуру
                |ГДЕ
                |    ЦеныНаНоменклатуру.Номенклатура = &Номенклатура";            
            Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаПоставка.Номенклатура);
            РезультатЗапроса = Запрос.Выполнить();

            СтараяЗакупочнаяЦена = 0;
            СтараяРозничнаяЦена = 0;
            Если РезультатЗапроса.Пустой() Тогда
               
            Иначе
                Выборка = РезультатЗапроса.Выбрать();
                Выборка.Следующий();
                СтараяЗакупочнаяЦена = Выборка.ЗакупочнаяЦена;
                СтараяРозничнаяЦена = Выборка.РозничнаяЦена;
            КонецЕсли;

          
            НоваяСтрока = Установка.Добавить();
            НоваяСтрока.НоменклатураД = ТекСтрокаПоставка.Номенклатура;
            НоваяСтрока.СтараяЦенаЗакупочная = СтараяЗакупочнаяЦена;
            НоваяСтрока.НоваяЦенаЗакупочная = ТекСтрокаПоставка.Цена;
            НоваяСтрока.СтараяЦенаРозничная = СтараяРозничнаяЦена;
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры
